Infineon/mtb-example-psoc-edge-ml-deepcraft-deploy-vision/proj_cm55/source/lcd_task.c
/******************************************************************************
* File Name:   lcd_task.c
*
* Description: This file implements the LCD display modules.
*
* Related Document: See README.md
*
********************************************************************************
* (c) 2025-2026, Infineon Technologies AG, or an affiliate of Infineon
* Technologies AG. All rights reserved.
* This software, associated documentation and materials ("Software") is
* owned by Infineon Technologies AG or one of its affiliates ("Infineon")
* and is protected by and subject to worldwide patent protection, worldwide
* copyright laws, and international treaty provisions. Therefore, you may use
* this Software only as provided in the license agreement accompanying the
* software package from which you obtained this Software. If no license
* agreement applies, then any use, reproduction, modification, translation, or
* compilation of this Software is prohibited without the express written
* permission of Infineon.
*
* Disclaimer: UNLESS OTHERWISE EXPRESSLY AGREED WITH INFINEON, THIS SOFTWARE
* IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
* INCLUDING, BUT NOT LIMITED TO, ALL WARRANTIES OF NON-INFRINGEMENT OF
* THIRD-PARTY RIGHTS AND IMPLIED WARRANTIES SUCH AS WARRANTIES OF FITNESS FOR A
* SPECIFIC USE/PURPOSE OR MERCHANTABILITY.
* Infineon reserves the right to make changes to the Software without notice.
* You are responsible for properly designing, programming, and testing the
* functionality and safety of your intended application of the Software, as
* well as complying with any legal requirements related to its use. Infineon
* does not guarantee that the Software will be free from intrusion, data theft
* or loss, or other breaches ("Security Breaches"), and Infineon shall have
* no liability arising out of any Security Breaches. Unless otherwise
* explicitly approved by Infineon, the Software may not be used in any
* application where a failure of the Product or any consequences of the use
* thereof can reasonably be expected to result in personal injury.
*******************************************************************************/

/*******************************************************************************
* Header File
*******************************************************************************/
#include "cybsp.h"
#include <string.h>
#include "retarget_io_init.h"
#include "no_camera_img.h"
#include "camera_not_supported_img.h"
#ifdef USE_KIT_PSE84_HMI
#include "mtb_display_st7701s.h"
#else
#include "mtb_disp_dsi_waveshare_4p3.h"
#endif
#include "FreeRTOS.h"
#include "task.h"
#include "FreeRTOSConfig.h"
#include "usb_camera_task.h"
#include "lcd_task.h"
#include "inference_task.h"
#include "ifx_gui_render.h"
#include "font_16x36.h"
#include "ifx_image_utils.h"
#include "ifx_time_utils.h"
#include "lcd_graphics.h"

#if defined(MTB_SHARED_MEM)
#include "shared_mem.h"
#endif

/*******************************************************************************
 * Macros
 *******************************************************************************/
#define I2C_CONTROLLER_IRQ_PRIORITY         (4U)

#define GPU_INT_PRIORITY                    (3U)
#define DC_INT_PRIORITY                     (3U)

#define COLOR_DEPTH                         (16U)
#define BITS_PER_PIXEL                      (8U)

#ifdef USE_KIT_PSE84_HMI
#define DISPLAY_HEIGHT                      (480U)
#define DISPLAY_WIDTH                       (512U)
#else
#define DISPLAY_HEIGHT                      (480U)
#define DISPLAY_WIDTH                       (832U)
#endif

#define DEFAULT_GPU_CMD_BUFFER_SIZE         ((64U) * (1024U))
#define GPU_TESSELLATION_BUFFER_SIZE        ((DISPLAY_HEIGHT) * 128U)

#define FRAME_BUFFER_SIZE                   ((DISPLAY_WIDTH) * (DISPLAY_HEIGHT) * ((COLOR_DEPTH) / (BITS_PER_PIXEL)))

#define VGLITE_HEAP_SIZE                    (((FRAME_BUFFER_SIZE) * (3)) + \
                                             (((DEFAULT_GPU_CMD_BUFFER_SIZE) + (GPU_TESSELLATION_BUFFER_SIZE)) * (NUM_IMAGE_BUFFERS)) + \
                                             ((CAMERA_BUFFER_SIZE) * (NUM_IMAGE_BUFFERS + 1)))

#define GPU_MEM_BASE                        (0x0U)

#define WHITE_COLOR                         (0x00FFFFFFU)
#define BLACK_COLOR                         (0x00000000U)
#define TARGET_NUM_FRAMES                   (15U)

/* Display I2C controller - Kit-specific configuration */
#ifdef USE_KIT_PSE84_AI
#define DISPLAY_I2C_CONTROLLER_HW           CYBSP_I2C_DISPLAY_CONTROLLER_HW
#define DISPLAY_I2C_CONTROLLER_IRQ          CYBSP_I2C_DISPLAY_CONTROLLER_IRQ
#define DISPLAY_I2C_CONTROLLER_config       CYBSP_I2C_DISPLAY_CONTROLLER_config
#elif defined(USE_KIT_PSE84_HMI)
/* HMI kit uses CYBSP_I2C_3V3 for display I2C */
#define DISPLAY_I2C_CONTROLLER_HW           CYBSP_I2C_3V3_HW
#define DISPLAY_I2C_CONTROLLER_IRQ          CYBSP_I2C_3V3_IRQ
#define DISPLAY_I2C_CONTROLLER_config       CYBSP_I2C_3V3_config
#else
#define DISPLAY_I2C_CONTROLLER_HW           CYBSP_I2C_CONTROLLER_HW
#define DISPLAY_I2C_CONTROLLER_IRQ          CYBSP_I2C_CONTROLLER_IRQ
#define DISPLAY_I2C_CONTROLLER_config       CYBSP_I2C_CONTROLLER_config
#endif

#ifdef USE_KIT_PSE84_HMI
#define ROTATE_ANGLE                        (90.0f)
#define ROTATE_MATRIX_X                     (240)
#define ROTATE_MATRIX_Y                     (240)
#define FLIP_MATRIX_X                       (1.0f)
#define FLIP_MATRIX_Y                       (1.0f)
#endif
#define NO_CAMERA_IMG_X_POS                 ((DISPLAY_WIDTH / 2U) \
                                             - ((NO_CAMERA_IMG_WIDTH / 2U) + 10))
#define NO_CAMERA_IMG_Y_POS                 ((DISPLAY_HEIGHT / 2U) \
                                             - (NO_CAMERA_IMG_HEIGHT / 2U))

#define CAMERA_NOT_SUPPORTED_IMG_X_POS      ((DISPLAY_WIDTH / 2U) \
                                             - ((CAMERA_NOT_SUPPORTED_IMG_WIDTH / 2U) + 10))
#define CAMERA_NOT_SUPPORTED_IMG_Y_POS      ((DISPLAY_HEIGHT / 2U) \
                                             - (CAMERA_NOT_SUPPORTED_IMG_HEIGHT / 2U))

#ifdef RPS_DEMO_MODE_ENABLED
#define LED_BLINK_DELAY_MS                  (200)
#endif
/*******************************************************************************
 * Global Variables
 ****************************************************************************** */
#ifdef USE_KIT_PSE84_HMI
mtb_display_st7701s_backlight_config_t st7701s_backlight_cfg =
{
    .bl_port    = CYBSP_DISP_BACKLIGHT_PWM_PORT,
    .bl_pin     = CYBSP_DISP_BACKLIGHT_PWM_PIN,
    .pwm_hw     = CYBSP_PWM_DISP_BACKLIGHT_HW,
    .pwm_num    = CYBSP_PWM_DISP_BACKLIGHT_NUM,
    .pwm_config = &CYBSP_PWM_DISP_BACKLIGHT_config
};
#endif
#ifdef USE_USB_CAM
/* Last successful USB frame time*/
static float last_successful_frame_time = 0;
/* USB recovery attempt counter */
static int recovery_attempts = 0;
#endif
/* USB semaphore for synchronization */
extern cy_semaphore_t usb_semaphore;
/* Object detection prediction */
extern prediction_od_t prediction;
/* Inference time for model */
extern volatile float inference_time;
/* Model semaphore for synchronization */
extern cy_semaphore_t model_semaphore;
/* Device connected */
extern uint8_t _device_connected;
/* Start time */
volatile float time_start1;
/* Graphics context structure */
cy_stc_gfx_context_t gfx_context;
/* Render target buffer*/
vg_lite_buffer_t *render_target;
/* USB YUV frame buffers */
vg_lite_buffer_t usb_yuv_frames[NUM_IMAGE_BUFFERS];
/* BGR565 buffer */
vg_lite_buffer_t bgr565;
/* Double display frame buffers */
vg_lite_buffer_t display_buffer[3];
/* Scale factor from camera to display */
float scale_cam_to_disp;

