Infineon/mtb-example-psoc-edge-ml-deepcraft-deploy-vision/proj_cm55/source/lcd_task.c
#ifdef USE_DVP_CAM
/* Inference task moved inside GFX task for DVP cam */
void cm55_inference_task ( void *arg );
static cy_thread_t inference_thread;
extern vg_lite_buffer_t dvp_bgr565_frames[NUM_IMAGE_BUFFERS];
extern bool active_frame;
#endif

CY_SECTION(".cy_socmem_data")
/* BGR888 integer buffer */
__attribute__((aligned(64)))
uint8_t bgr888_uint8[MODEL_INPUT_MAX_BYTES] = {0};

CY_SECTION(".cy_xip") __attribute__((used))
/* Contiguous memory for VGLite heap */
uint8_t contiguous_mem[VGLITE_HEAP_SIZE];
/* VGLite heap base address */
volatile void *vglite_heap_base = &contiguous_mem;
/* framebuffer pending flag */
volatile bool fb_pending = false;

/*******************************************************************************
 * Global Variables - Shared memory variable
 *******************************************************************************/
#if defined(MTB_SHARED_MEM)
oob_shared_data_t oob_shared_data_ns;
#endif

/*******************************************************************************
 * Global Variables - I2C Controller Configuration
 ****************************************************************************** */
 /* I2C controller context */
cy_stc_scb_i2c_context_t i2c_controller_context;

/*******************************************************************************
 * Global Variables - Interrupt Configurations
 *******************************************************************************/
 /* DC Interrupt Configuration */
cy_stc_sysint_t dc_irq_cfg =
{
    .intrSrc      = gfxss_interrupt_dc_IRQn,
    .intrPriority = DC_INT_PRIORITY
};
/* GPU Interrupt Configuration*/
cy_stc_sysint_t gpu_irq_cfg =
{
    .intrSrc      = gfxss_interrupt_gpu_IRQn,
    .intrPriority = GPU_INT_PRIORITY
};
/* I2C Controller Interrupt Configuration */
cy_stc_sysint_t i2c_controller_irq_cfg =
{
    .intrSrc      = DISPLAY_I2C_CONTROLLER_IRQ,
    .intrPriority = I2C_CONTROLLER_IRQ_PRIORITY
};

/*******************************************************************************
 * Local Variables
 *******************************************************************************/
 /* Graphics subsystem base address */
static GFXSS_Type *base = (GFXSS_Type *)GFXSS;
/* VGLite transformation matrix */
static vg_lite_matrix_t matrix;
/* Display X offset */
static int display_offset_x = 0;
/* Display Y offset */
static int display_offset_y = 0;

#ifdef USE_KIT_PSE84_HMI
/*******************************************************************************
* Function Name: rotate_bbox
********************************************************************************
* Description: Rotates a rectangle by 90 degrees clockwise around the configured
*              display center used by the camera transform matrix and returns the
*              axis-aligned bounds of the rotated rectangle.
* Parameters:
*   - xmin, ymin, xmax, ymax: Rectangle bounds to rotate (in/out)
*
* Return:
*   None
********************************************************************************/
static void rotate_bbox(uint32_t *xmin, uint32_t *ymin, uint32_t *xmax, uint32_t *ymax)
{
    uint32_t x0 = *xmin, x1 = *xmax, y0 = *ymin, y1 = *ymax;
    *xmin = (2 * ROTATE_MATRIX_X) - y1;
    *ymin = x0;
    *xmax = (2 * ROTATE_MATRIX_X) - y0;
    *ymax = x1;
}
#endif

/* Red components: {Green, Black, Red, Blue} */
static uint8_t color_r[4] = {0, 0, 227, 8}; 
/* Green components: {Green, Black, Red, Blue} */                   
static uint8_t color_g[4] = {255, 0, 66, 24};  
/* Blue components: {Green, Black, Red, Blue} */                
static uint8_t color_b[4] = {0, 0, 52, 168};                   

CY_SECTION_ITCM_BEGIN
/*******************************************************************************
* Function Name: letterbox_bgr565_to_rgb888
********************************************************************************
* Description: Letterbox resize of a BGR565 image to an RGB888 output.
*              Scales the source image to fit within dst_w x dst_h while
*              maintaining aspect ratio. Unfilled regions are zero (black).
*              Uses nearest-neighbor sampling.
*
* Parameters:
*   src_bgr565 - pointer to source BGR565 image data
*   src_w, src_h - source dimensions
*   dst_rgb888 - pointer to destination RGB888 buffer (must be pre-zeroed)
*   dst_w, dst_h - destination dimensions
*   out_pad_x, out_pad_y - if non-NULL, receives the padding offsets
*   out_scale - if non-NULL, receives the scale factor used
*
* Return: None
********************************************************************************/
static void letterbox_bgr565_to_rgb888(const uint8_t *src_bgr565, int src_w, int src_h,
                                        uint8_t *dst_rgb888, int dst_w, int dst_h,
                                        int *out_pad_x, int *out_pad_y, float *out_scale)
{
    float scale_x = (float)dst_w / (float)src_w;
    float scale_y = (float)dst_h / (float)src_h;
    float scale = (scale_x < scale_y) ? scale_x : scale_y;

    int new_w = (int)(src_w * scale);
    int new_h = (int)(src_h * scale);
    int pad_x = (dst_w - new_w) / 2;
    int pad_y = (dst_h - new_h) / 2;

    if (out_pad_x) *out_pad_x = pad_x;
    if (out_pad_y) *out_pad_y = pad_y;
    if (out_scale)  *out_scale  = scale;

    const uint16_t *src16 = (const uint16_t *)src_bgr565;

    for (int dy = 0; dy < new_h; dy++)
    {
        int sy = dy * src_h / new_h;
        const uint16_t *src_row = &src16[sy * src_w];
        uint8_t *dst = &dst_rgb888[((dy + pad_y) * dst_w + pad_x) * 3];

        for (int dx = 0; dx < new_w; dx++)
        {
            int sx = dx * src_w / new_w;
            uint16_t pixel = src_row[sx];

            *dst++ = (pixel >> 8) & 0xF8;   /* red */
            *dst++ = (pixel >> 3) & 0xFC;   /* green */
            *dst++ = (pixel << 3) & 0xF8;   /* blue */
        }
    }
}
CY_SECTION_ITCM_END

CY_SECTION_ITCM_BEGIN
/*******************************************************************************
* Function Name: mirror_image
********************************************************************************
* Description: Mirrors an image horizontally by swapping pixels from left to right
*              in the provided buffer. The function assumes a fixed bytes-per-pixel
*              value of 2 (e.g., for RGB565 format) and operates on a buffer with
*              dimensions defined by CAMERA_WIDTH and CAMERA_HEIGHT.
* Parameters:
*   - buffer: Pointer to the vg_lite_buffer_t structure containing the image data
*
* Return:
*   None
********************************************************************************/
void mirror_image(vg_lite_buffer_t *buffer) {
    uint8_t temp[4];
    uint8_t *start, *end;
    int m, n;
    int bytes_per_pixel  = 2;

    for (m = 0; m < CAMERA_HEIGHT ; m++) {

        start = buffer->memory + m * (CAMERA_WIDTH * bytes_per_pixel);

        end = start + (CAMERA_WIDTH - 1) * bytes_per_pixel;

        for (n = 0; n < CAMERA_WIDTH / 2; n++) {

            for (int i = 0; i < bytes_per_pixel; i++) {
                temp[i] = start[i];
            }

            for (int i = 0; i < bytes_per_pixel; i++) {
                start[i] = end[i];
            }

            for (int i = 0; i < bytes_per_pixel; i++) {
                end[i] = temp[i];
            }

            start += bytes_per_pixel;
            end -= bytes_per_pixel;
        }
    }
}

CY_SECTION_ITCM_END
/*******************************************************************************
* Function Name: cleanup
********************************************************************************
* Description: Deallocates resources and frees memory used by the VGLite
*              graphics library. This function should be called to ensure proper
*              cleanup of VGLite resources when they are no longer needed.
* Parameters:
*   None
*
* Return:
*   None
********************************************************************************/
static void cleanup ( void )
{
    /* Deallocate all the resource and free up all the memory */
    vg_lite_close();
}


CY_SECTION_ITCM_BEGIN
/*******************************************************************************
* Function Name: draw
********************************************************************************
 * Description: Processes and renders an image from a USB camera buffer. The function
 *              performs the following steps:
 *              1. Waits for a ready image buffer from the camera.
 *              2. Converts a 320x240 YUYV 422 image to 320x240 BGR565 format.
 *              3. Optionally mirrors the image if the 3MP camera is disabled.
 *              4. Scales the 320x240 BGR565 image to 800x600 BGR565 for display.
 *              5. Converts the 320x240 BGR565 image to 256x240 BGR888 format (offset by -128).
 *              6. Tracks performance metrics for each step and returns the BGR888 buffer.
 *              The function handles errors by invoking cleanup and asserting on failure.
* Parameters:
*   bgr888_int8 Pointer to the int8_t BGR888 buffer containing the processed image data
*
* Return:
*   None
*
********************************************************************************/
uint8_t * draw(void)
{
    vg_lite_error_t error = VG_LITE_SUCCESS;
    volatile uint32_t time_draw_start = ifx_time_get_ms_f();
    const model_runtime_profile_t *model_profile = get_model_runtime_profile();
    int model_input_w = (int)model_profile->input_width;
    int model_input_h = (int)model_profile->input_height;
#ifdef USE_USB_CAM
    extern uint8_t last_buffer;
    extern video_buffer_t _image_buff[];

    // find a ready buffer
    uint32_t work_buffer = last_buffer;

