Infineon/mtb-example-psoc-edge-ml-deepcraft-deploy-vision/proj_cm55/source/lcd_task.c
    while (_image_buff[work_buffer].buff_ready == 0) {
        for (int32_t ii = 0; ii < NUM_IMAGE_BUFFERS; ii++)
            if (_image_buff[(work_buffer + ii) % NUM_IMAGE_BUFFERS].buff_ready == 1) {
                work_buffer = (work_buffer + ii) % NUM_IMAGE_BUFFERS;
                break;
            }
        cy_rtos_delay_milliseconds(1);
    }

    /* Reset all other buffers to available for input from camera */
    for (int32_t ii = 1; ii < NUM_IMAGE_BUFFERS; ii++)
        _image_buff[(work_buffer + ii) % NUM_IMAGE_BUFFERS].buff_ready = 0;
#endif
    /* convert 320x240 YUYV 422 image into 320*240 BGR565 (scale:1) */
    volatile uint32_t time_draw_1 = ifx_time_get_ms_f();
#ifdef USE_USB_CAM
    error = vg_lite_blit(&bgr565, &usb_yuv_frames[work_buffer],
                         NULL,                       // identity matrix
                         VG_LITE_BLEND_NONE,
                         0,
                         VG_LITE_FILTER_POINT);
#endif
#ifdef USE_DVP_CAM
    error = vg_lite_blit(&bgr565, &dvp_bgr565_frames[active_frame],
                         NULL,                       // identity matrix
                         VG_LITE_BLEND_NONE,
                         0,
                         VG_LITE_FILTER_POINT);
#endif

    if (error) {
        printf("\r\nvg_lite_blit() (320x240 YUYV 422 ==> 320*240 BGR565) returned error %d\r\n", error);
        cleanup();
        CY_ASSERT(0);
    }

    vg_lite_finish();

#ifdef USE_USB_CAM
    if (!point3mp_camera_enabled) {
        mirror_image(&bgr565);
    }
#endif
    /* convert 320x240 BGR565 image into 800x600 BGR565 (scale:2.5) */
    volatile uint32_t time_draw_3 = ifx_time_get_ms_f();
    error = vg_lite_blit(render_target, &bgr565,
                         &matrix,
                         VG_LITE_BLEND_NONE,
                         0,
                         VG_LITE_FILTER_POINT);
    if (error) {
        printf("\r\nvg_lite_blit() (320x240 BGR565 ==> 800x600 display BGR565) returned error %d\r\n", error);
        cleanup();
        CY_ASSERT(0);
    }
    vg_lite_finish();

#ifdef USE_USB_CAM
    /* Clear USB buffer */
    _image_buff[work_buffer].num_bytes = 0;
    _image_buff[work_buffer].buff_ready = 0;
#endif
    if ((model_input_w <= 0) || (model_input_h <= 0) ||
        (model_input_w > MODEL_INPUT_MAX_WIDTH) || (model_input_h > MODEL_INPUT_MAX_HEIGHT)) {
        printf("Invalid model input dimensions in draw(): %dx%d\r\n", model_input_w, model_input_h);
        CY_ASSERT(0);
    }

    /* Convert BGR565 to model input RGB888 according to runtime compatibility mode. */
    volatile uint32_t time_draw_5 = ifx_time_get_ms_f();
    if (model_profile->preprocess_mode == MODEL_PREPROCESS_CROP)
    {
        ifx_image_conv_RGB565_to_RGB888_i8(bgr565.memory,
                                           CAMERA_WIDTH,
                                           CAMERA_HEIGHT,
                                           bgr888_uint8,
                                           model_input_w,
                                           model_input_h);
    }
    else
    {
        memset(bgr888_uint8, 0, (size_t)model_input_w * (size_t)model_input_h * 3U);
        letterbox_bgr565_to_rgb888(bgr565.memory, CAMERA_WIDTH, CAMERA_HEIGHT,
                                   bgr888_uint8, model_input_w, model_input_h,
                                   NULL, NULL, NULL);
    }

    volatile uint32_t time_draw_end = ifx_time_get_ms_f();
    // performance measures: time
    extern float prep_wait_buf, prep_YUV422_to_bgr565, prep_bgr565_to_disp, prep_RGB565_to_RGB888;
    prep_wait_buf         = time_draw_1 - time_draw_start;
    prep_YUV422_to_bgr565 = time_draw_3 - time_draw_1;
    prep_bgr565_to_disp   = time_draw_5 - time_draw_3;
    prep_RGB565_to_RGB888 = time_draw_end - time_draw_5;

    return bgr888_uint8;
}
CY_SECTION_ITCM_END

/*******************************************************************************
* Function Name: dc_irq_handler
********************************************************************************
* Summary: This is the display controller I2C interrupt handler.
*
* Parameters:
*   None
*
* Return:
*   None
*
*******************************************************************************/
static void dc_irq_handler ( void )
{
    fb_pending = false;
    Cy_GFXSS_Clear_DC_Interrupt(base, &gfx_context);
}

/*******************************************************************************
* Function Name: dc_gpu_irq_handlerirq_handler
********************************************************************************
* Summary: This is the GPU interrupt handler.
*
* Parameters:
*   None
*
* Return:
*   None
*
*******************************************************************************/
static void gpu_irq_handler ( void )
{
    Cy_GFXSS_Clear_GPU_Interrupt(base, &gfx_context);
    vg_lite_IRQHandler();
}

/*******************************************************************************
* Function Name: update_box_data
*******************************************************************************
*
* Summary:
*  Updates and draws bounding boxes on the render target based on object detection
*  predictions. Scales bounding box coordinates to display dimensions, sets colors
*  based on class IDs, and draws rectangles and labels for each detected object.
*
* Parameters:
*  render_target - Pointer to the vg_lite_buffer_t structure for rendering.
*  prediction   - Pointer to the prediction_od_t structure containing object
*                 detection results, including bounding box coordinates, class IDs,
*                 and confidence scores.
*
* Return:
*  None
*
*
*******************************************************************************/
void update_box_data(vg_lite_buffer_t *render_target, prediction_od_t *prediction)
{
    for (int32_t i = 0; i < prediction->count; i++) {
        int32_t jj = i << 2;
        int32_t id = prediction->class_id[i];
        int32_t cid = (id >= 0) ? (id % 3) + 1 : 0;

        int32_t cam_xmin = prediction->bbox_int16[jj];
        int32_t cam_ymin = prediction->bbox_int16[jj + 1];
        int32_t cam_xmax = prediction->bbox_int16[jj + 2];
        int32_t cam_ymax = prediction->bbox_int16[jj + 3];

        if (cam_xmin < 0) cam_xmin = 0;
        if (cam_ymin < 0) cam_ymin = 0;
        if (cam_xmax < 0) cam_xmax = 0;
        if (cam_ymax < 0) cam_ymax = 0;

