Infineon/mtb-example-psoc-edge-ml-deepcraft-deploy-vision/proj_cm55/source/lcd_task.c
        if (cam_xmin > CAMERA_WIDTH - 1) cam_xmin = CAMERA_WIDTH - 1;
        if (cam_ymin > CAMERA_HEIGHT - 1) cam_ymin = CAMERA_HEIGHT - 1;
        if (cam_xmax > CAMERA_WIDTH - 1) cam_xmax = CAMERA_WIDTH - 1;
        if (cam_ymax > CAMERA_HEIGHT - 1) cam_ymax = CAMERA_HEIGHT - 1;

        if (cam_xmax < cam_xmin)
        {
            int32_t t = cam_xmin;
            cam_xmin = cam_xmax;
            cam_xmax = t;
        }
        if (cam_ymax < cam_ymin)
        {
            int32_t t = cam_ymin;
            cam_ymin = cam_ymax;
            cam_ymax = t;
        }

        /* Scale and offset bounding box coordinates */
        uint32_t xmin = (uint32_t)(cam_xmin * scale_cam_to_disp) + display_offset_x;
        uint32_t ymin = (uint32_t)(cam_ymin * scale_cam_to_disp) + display_offset_y;
        uint32_t xmax = (uint32_t)(cam_xmax * scale_cam_to_disp) + display_offset_x;
        uint32_t ymax = (uint32_t)(cam_ymax * scale_cam_to_disp) + display_offset_y;

    #ifdef USE_KIT_PSE84_HMI
        /* Rotate the bounding box */
        rotate_bbox(&xmin, &ymin, &xmax, &ymax);
    #endif

        // Set foreground color based on class ID
        if (cid == 3) {
            ifx_lcd_set_FGcolor(8, 24, 168); // Blue
        } else if (cid == 1) {
            ifx_lcd_set_FGcolor(0, 0, 0); // Black
        } else if (cid == 2) {
            ifx_lcd_set_FGcolor(227, 66, 24); // Red
        }

        // Draw rectangle for the bounding box
        ifx_lcd_draw_Rect(xmin, ymin, xmax, ymax);

        // Draw label with class name and confidence score for valid class IDs
        if (id >= 0 && cid < 4) {
            ifx_set_bg_color((color_r[cid] << 16) | (color_g[cid] << 8) | color_b[cid]);
            ifx_print_to_buffer(xmin + 8, ymin - 36, "%s, %.2f", prediction->class_string[i], prediction->conf[i] * 100.0f);
            printf("------------------------------------------------\r\n");
            printf("%s \r\n", prediction->class_string[i]);
#ifdef RPS_DEMO_MODE_ENABLED
            if (id == 0)
            {
                Cy_GPIO_Write(CYBSP_LED_RGB_GREEN_PORT, CYBSP_LED_RGB_GREEN_PIN, 1);
                Cy_SysLib_Delay(LED_BLINK_DELAY_MS);
                Cy_GPIO_Write(CYBSP_LED_RGB_GREEN_PORT, CYBSP_LED_RGB_GREEN_PIN, 0);
            }
            else if (id == 1)
            {
                Cy_GPIO_Write(CYBSP_LED_RGB_BLUE_PORT, CYBSP_LED_RGB_BLUE_PIN, 1);
                Cy_SysLib_Delay(LED_BLINK_DELAY_MS);
                Cy_GPIO_Write(CYBSP_LED_RGB_BLUE_PORT, CYBSP_LED_RGB_BLUE_PIN, 0);
            }
            else
            {
                Cy_GPIO_Write(CYBSP_LED_RGB_RED_PORT, CYBSP_LED_RGB_RED_PIN, 1);
                Cy_SysLib_Delay(LED_BLINK_DELAY_MS);
                Cy_GPIO_Write(CYBSP_LED_RGB_RED_PORT, CYBSP_LED_RGB_RED_PIN, 0);
            }
#endif

        }

        // Render the buffer
        ifx_draw_buffer(render_target->memory);
    }
}

/*******************************************************************************
* Function Name: update_box_data1
*******************************************************************************
*
* Summary:
*  Displays model inference time on the render target at a fixed position. Sets
*  the background color using predefined RGB values and prints the inference time
*  with a label.
*
* Parameters:
*  render_target - Pointer to the vg_lite_buffer_t structure for rendering.
*  num          - Floating-point value representing the model inference time in
*                 milliseconds.
*
* Return:
*  None
*
*
*******************************************************************************/
void update_box_data1(vg_lite_buffer_t *render_target, float num)
{
    ifx_set_bg_color((color_r[3] << 16) | (color_g[3] << 8) | color_b[3]); // Set background color
    ifx_print_to_buffer(10, 440, "%s %.1f %s", "Model", num, "ms");         // Print inference time
    ifx_draw_buffer(render_target->memory);                                   // Render the buffer
}


/*******************************************************************************
* Function Name: VG_LITE_ERROR_EXIT
*******************************************************************************
*
* Summary:
*  Handles VGLite error conditions by printing an error message with the status
*  code, calling the cleanup function to deallocate resources, and triggering an
*  assertion to halt execution.
*
* Parameters:
*  msg           - Pointer to a character string describing the error context.
*  vglite_status - VGLite error code indicating the specific error condition.
*
* Return:
*  None
*
*
*******************************************************************************/
void VG_LITE_ERROR_EXIT(char *msg, vg_lite_error_t vglite_status)
{
    printf("%s %d\r\n", msg, vglite_status); // Print error message and status
    cleanup();                               // Deallocate VGLite resources
    CY_ASSERT(0);                            // Halt execution
}

/*******************************************************************************
* Function Name: disp_i2c_controller_interrupt
********************************************************************************
* Summary:
*  I2C controller ISR which invokes Cy_SCB_I2C_Interrupt to perform I2C transfer
*  as controller.
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
static void i2c_controller_interrupt(void)
{
    Cy_SCB_I2C_Interrupt(DISPLAY_I2C_CONTROLLER_HW, &i2c_controller_context);
}

/*******************************************************************************
* Function Name: VG_switch_frame
*******************************************************************************
*
* Summary:
*  Switches the video/graphics layer frame buffer and manages buffer swapping for
*  display rendering. Signals the USB semaphore based on camera enable status.
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
void VG_switch_frame(void)
{
    /* Set Video/Graphics layer buffer address and transfer the frame buffer to DC */
    Cy_GFXSS_Set_FrameBuffer(base, (uint32_t*)render_target->address, &gfx_context);
    __DMB();

#ifdef USE_USB_CAM
    static int current_buffer = 0;
    /* Swap buffers */
    current_buffer ^= 1;
    render_target = &display_buffer[current_buffer];

    __DMB();

    if (!logitech_camera_enabled)
    {
        cy_rtos_semaphore_set(&usb_semaphore);
    }
    else
    {
        cy_rslt_t result = cy_rtos_semaphore_get(&usb_semaphore, 0xFFFFFFFF);
        if (CY_RSLT_SUCCESS != result)
        {
            printf("[USB Camera] USB Semaphore set failed\r\n");
        }
    }
#endif
}

