Infineon/mtb-example-psoc-edge-ml-deepcraft-deploy-vision/proj_cm55/source/lcd_task.c
/*******************************************************************************
* Function Name: init_buffer_system
*******************************************************************************
*
* Summary:
*  Initializes the buffer system by resetting image buffer states, clearing buffer
*  counters, and resetting timeout tracking variables.
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
#ifdef USE_USB_CAM
static void init_buffer_system(void)
{
    // Ensure clean startup state
    for (int i = 0; i < NUM_IMAGE_BUFFERS; i++)
    {
        _image_buff[i].buff_ready = 0;
        _image_buff[i].num_bytes = 0;
    }
    __DMB();

    last_buffer = 0;
    __DMB();

    // Reset timeout tracking
    last_successful_frame_time = 0;
    recovery_attempts = 0;
}
#endif

/*******************************************************************************
* Function Name: cm55_ns_gfx_task
*******************************************************************************
*
* Summary:
*  Initializes and manages the graphics subsystem, including display controller,
*  I2C, VGLite, and buffer systems. Handles rendering of camera frames or fallback
*  images based on device connection status, updates display with bounding box data,
*  and manages frame buffer swapping.
*
* Parameters:
*  arg - Unused task argument
*
* Return:
*  None
*
*******************************************************************************/
void cm55_ns_gfx_task(void *arg)
{
    CY_UNUSED_PARAMETER(arg);
    vg_lite_error_t vglite_status = VG_LITE_SUCCESS;
    cy_rslt_t result = CY_RSLT_SUCCESS;
    cy_en_gfx_status_t status = CY_GFX_SUCCESS;
    volatile float time_start = 0;
    volatile float time_prev = 0;
    volatile float time_end = 0;
    (void)time_prev;
    (void)time_end;
    cy_en_sysint_status_t sysint_status = CY_SYSINT_SUCCESS;
    cy_en_scb_i2c_status_t i2c_result = CY_SCB_I2C_SUCCESS;

    /* Set frame buffer address to the GFXSS configuration structure */
    GFXSS_config.dc_cfg->gfx_layer_config->buffer_address = (gctADDRESS *)vglite_heap_base;
    GFXSS_config.dc_cfg->gfx_layer_config->uv_buffer_address = (gctADDRESS *)vglite_heap_base;

    /* Initialize the graphics subsystem according to the configuration */
    status = Cy_GFXSS_Init(base, &GFXSS_config, &gfx_context);
    if (CY_GFX_SUCCESS != status)
    {
        printf("Graphics subsystem initialization failed: Cy_GFXSS_Init() returned error %d\r\n", status);
        CY_ASSERT(0);
    }

    mtb_hal_syspm_lock_deepsleep();

    /* Setup Display Controller interrupt */
    sysint_status = Cy_SysInt_Init(&dc_irq_cfg, dc_irq_handler);
    if (CY_SYSINT_SUCCESS != sysint_status)
    {
        printf("Error in registering DC interrupt: %d\r\n", sysint_status);
        CY_ASSERT(0);
    }
    NVIC_EnableIRQ(GFXSS_DC_IRQ);
    Cy_GFXSS_Clear_DC_Interrupt(base, &gfx_context);

    /* Initialize GFX GPU interrupt */
    sysint_status = Cy_SysInt_Init(&gpu_irq_cfg, gpu_irq_handler);
    if (CY_SYSINT_SUCCESS != sysint_status)
    {
        printf("Error in registering GPU interrupt: %d\r\n", sysint_status);
        CY_ASSERT(0);
    }
    Cy_GFXSS_Enable_GPU_Interrupt(base);
    NVIC_EnableIRQ(GFXSS_GPU_IRQ);

    /* Initialize the I2C in controller mode */
    i2c_result = Cy_SCB_I2C_Init(DISPLAY_I2C_CONTROLLER_HW, &DISPLAY_I2C_CONTROLLER_config, &i2c_controller_context);
    if (CY_SCB_I2C_SUCCESS != i2c_result)
    {
        printf("I2C controller initialization failed !!\n");
    }

    /* Initialize the I2C interrupt */
    sysint_status = Cy_SysInt_Init(&i2c_controller_irq_cfg, &i2c_controller_interrupt);
    if (CY_SYSINT_SUCCESS != sysint_status)
    {
        printf("I2C controller interrupt initialization failed\r\n");
    }
    NVIC_EnableIRQ(i2c_controller_irq_cfg.intrSrc);
    Cy_SCB_I2C_Enable(DISPLAY_I2C_CONTROLLER_HW);
    
    /* Allow I2C to be stabalized to initialize the display */
    Cy_SysLib_Delay(200);

    ifx_lcd_set_Display_size(DISPLAY_WIDTH, DISPLAY_HEIGHT);

#ifdef USE_KIT_PSE84_HMI
    /* Initialize ST7701S display */
    printf("Initializing ST7701S display...\r\n");

    result = mtb_display_st7701s_init(GFXSS_GFXSS_MIPIDSI, &st7701s_backlight_cfg);
    if (CY_RSLT_SUCCESS != result)
    {
        printf("ST7701S display init failed with status = 0x%lX\r\n", (unsigned long)result);
        CY_ASSERT(0);
    }
    else
    {
        printf("ST7701S display initialized successfully\r\n");
        
        /* Set backlight brightness to 100% */
        uint8_t brightness_level = 100U;
        mtb_display_st7701s_set_brightness(brightness_level);
        printf("ST7701S backlight set to 100%%\r\n");
    }
#else
    /* Initialize Waveshare 4.3-Inch display */
    i2c_result = mtb_disp_waveshare_4p3_init(DISPLAY_I2C_CONTROLLER_HW, &i2c_controller_context);
    if (CY_SCB_I2C_SUCCESS != i2c_result)
    {
        printf("Waveshare 4.3-Inch display init failed with status = %u\r\n", (unsigned int)i2c_result);
    }
#endif

    /* Initialize VGLite memory parameters */
    vg_module_parameters_t vg_params;
    vg_params.register_mem_base = (uint32_t)GFXSS_GFXSS_GPU_GCNANO;
    vg_params.gpu_mem_base[0] = GPU_MEM_BASE;
    vg_params.contiguous_mem_base[0] = (volatile void *)vglite_heap_base;
    vg_params.contiguous_mem_size[0] = VGLITE_HEAP_SIZE;

    /* Initialize VGLite */
    vg_lite_init_mem(&vg_params);
    vglite_status = vg_lite_init(DISPLAY_WIDTH, DISPLAY_HEIGHT);
    if (VG_LITE_SUCCESS != vglite_status)
    {
        VG_LITE_ERROR_EXIT("vg_lite engine init failed: vg_lite_init() returned error %d\r\n", vglite_status);
    }

    /* Setup double display frame buffers */
    for (int32_t ii = 0; ii < 2; ii++)
    {
        display_buffer[ii].width = DISPLAY_WIDTH;
        display_buffer[ii].height = DISPLAY_HEIGHT;
        display_buffer[ii].format = VG_LITE_BGR565;
        vglite_status = vg_lite_allocate(&display_buffer[ii]);
        if (VG_LITE_SUCCESS != vglite_status)
        {
            VG_LITE_ERROR_EXIT("display_buffer[] allocation failed in vglite space: vg_lite_allocate() returned error %d\r\n", vglite_status);
        }
    }
    render_target = &display_buffer[0];

#ifdef USE_USB_CAM
    /* Allocate the camera buffers */
    for (int32_t i = 0; i < NUM_IMAGE_BUFFERS; i++)
    {
        usb_yuv_frames[i].width = CAMERA_WIDTH;
        usb_yuv_frames[i].height = CAMERA_HEIGHT;
        usb_yuv_frames[i].format = VG_LITE_YUYV;
        usb_yuv_frames[i].image_mode = VG_LITE_NORMAL_IMAGE_MODE;
        vglite_status = vg_lite_allocate(&usb_yuv_frames[i]);
        if (VG_LITE_SUCCESS != vglite_status)
        {
            VG_LITE_ERROR_EXIT("USB camera buffers allocation failed in vglite space: vg_lite_allocate() returned error %d\r\n", vglite_status);
        }
    }
#endif
#ifdef USE_DVP_CAM
    for ( uint8_t i = 0; i < NUM_IMAGE_BUFFERS; i++ )
    {
        dvp_bgr565_frames[i].width = CAMERA_WIDTH;
        dvp_bgr565_frames[i].height = CAMERA_HEIGHT;
        dvp_bgr565_frames[i].format = VG_LITE_BGR565;
        dvp_bgr565_frames[i].image_mode = VG_LITE_NORMAL_IMAGE_MODE;
        vglite_status = vg_lite_allocate(&dvp_bgr565_frames[i]);
        if (VG_LITE_SUCCESS != vglite_status)
        {
            VG_LITE_ERROR_EXIT("DVP camera buffers allocation failed in vglite space: vg_lite_allocate() returned error %d\r\n", vglite_status);
        }
    }
#endif
    /* Allocate the work camera buffer */
    bgr565.width = CAMERA_WIDTH;
    bgr565.height = CAMERA_HEIGHT;
    bgr565.format = VG_LITE_BGR565;
    bgr565.image_mode = VG_LITE_NORMAL_IMAGE_MODE;
    vglite_status = vg_lite_allocate(&bgr565);
    if (VG_LITE_SUCCESS != vglite_status)
    {
        VG_LITE_ERROR_EXIT("work camera image bgr565 allocation failed in vglite space: vg_lite_allocate() returned error %d\r\n", vglite_status);
    }

    /* Clear the buffer with black color */
    vglite_status = vg_lite_clear(render_target, NULL, BLACK_COLOR);
    if (VG_LITE_SUCCESS != vglite_status)
    {
        VG_LITE_ERROR_EXIT("Clear failed: vg_lite_clear() returned error %d\r\n", vglite_status);
    }

    /* Define the transformation matrix for camera image to display */
    vg_lite_identity(&matrix);
    float scale_cam_to_disp_x = (float)(DISPLAY_WIDTH) / (float)CAMERA_WIDTH;
    float scale_cam_to_disp_y = (float)(DISPLAY_HEIGHT) / (float)CAMERA_HEIGHT;
    scale_cam_to_disp = max(scale_cam_to_disp_x, scale_cam_to_disp_y);
    vg_lite_scale(scale_cam_to_disp, scale_cam_to_disp, &matrix);

    /* Move the scaled frame to the display center */
    float translate_x = ((DISPLAY_WIDTH) / scale_cam_to_disp - CAMERA_WIDTH) * 0.5f;
    float translate_y = (DISPLAY_HEIGHT / scale_cam_to_disp - CAMERA_HEIGHT) * 0.5f;
    vg_lite_translate(translate_x, translate_y, &matrix);

    display_offset_x = ((DISPLAY_WIDTH) - scale_cam_to_disp * CAMERA_WIDTH) / 2;
    display_offset_y = (DISPLAY_HEIGHT - scale_cam_to_disp * CAMERA_HEIGHT) / 2;

