Infineon/mtb-example-psoc-edge-ml-deepcraft-deploy-vision/proj_cm55/source/lcd_task.c
#ifdef USE_KIT_PSE84_HMI
    /* Define the rotation matrix (90 degrees) and apply vertical flip */
    vg_lite_identity(&matrix);
    vg_lite_translate(ROTATE_MATRIX_X, ROTATE_MATRIX_Y, &matrix);
    vg_lite_rotate(ROTATE_ANGLE, &matrix);
    /* Apply vertical flip */
    vg_lite_scale(FLIP_MATRIX_X, FLIP_MATRIX_Y, &matrix);
    vg_lite_translate(-ROTATE_MATRIX_X, -ROTATE_MATRIX_Y, &matrix);
    vg_lite_scale(scale_cam_to_disp, scale_cam_to_disp, &matrix);
#endif

    Cy_GFXSS_Set_FrameBuffer(base, (uint32_t *)render_target->address, &gfx_context);
    vg_lite_flush();
    Cy_GFXSS_Set_FrameBuffer(base, (uint32_t *)render_target->address, &gfx_context);

    /* Delay for USB enumeration to complete before rendering */
    vTaskDelay(pdMS_TO_TICKS(1500));

    /* Initialize buffer states - clear any startup artifacts */
#ifdef USE_USB_CAM
    for (int i = 0; i < NUM_IMAGE_BUFFERS; i++)
    {
        _image_buff[i].buff_ready = 0;
        _image_buff[i].num_bytes = 0;
    }
    __DMB();

    init_buffer_system();
#endif
#ifdef USE_DVP_CAM
    /* DVP camera requires the buffers to be initialized and formatted as per desired configurations */
    result = cy_rtos_thread_create( &inference_thread, &cm55_inference_task, INFERENCE_TASK_NAME, NULL,
                                    INFERENCE_TASK_STACK_SIZE, INFERENCE_TASK_PRIORITY, NULL);
    if ( CY_RSLT_SUCCESS != result ) {
        CY_ASSERT(0);
    }
#endif
    for (;;)
    {
#ifdef USE_USB_CAM
        if (!_device_connected)
        {
            int i = 0;
            while (i < 2)
            {
                i++;
                __DMB();
                vg_lite_finish();
                Cy_GFXSS_Set_FrameBuffer(base, (uint32_t *)render_target->address, &gfx_context);
                __DMB();

                /* Clear the buffer with black color */
                vglite_status = vg_lite_clear(render_target, NULL, BLACK_COLOR);
                if (VG_LITE_SUCCESS != vglite_status)
                {
                    VG_LITE_ERROR_EXIT("Clear failed: vg_lite_clear() returned error %d\r\n", vglite_status);
                }
                __DMB();

                ifx_lcd_display_Rect(NO_CAMERA_IMG_X_POS, NO_CAMERA_IMG_Y_POS, (uint8_t *)no_camera_img_map, NO_CAMERA_IMG_WIDTH, NO_CAMERA_IMG_HEIGHT);

                Cy_GFXSS_Set_FrameBuffer(base, (uint32_t *)render_target->address, &gfx_context);
                __DMB();
            }
        }
        else
        {
            if (Camera_not_supported)
            {
                int i = 0;
                while (i < 2)
                {
                    i++;
                    __DMB();
                    vg_lite_finish();
                    Cy_GFXSS_Set_FrameBuffer(base, (uint32_t *)render_target->address, &gfx_context);
                    __DMB();

                    /* Clear the buffer with black color */
                    vglite_status = vg_lite_clear(render_target, NULL, BLACK_COLOR);
                    if (VG_LITE_SUCCESS != vglite_status)
                    {
                        VG_LITE_ERROR_EXIT("Clear failed: vg_lite_clear() returned error %d\r\n", vglite_status);
                    }
                    __DMB();

                    ifx_lcd_display_Rect(CAMERA_NOT_SUPPORTED_IMG_X_POS, CAMERA_NOT_SUPPORTED_IMG_Y_POS, (uint8_t *)camera_not_supported_img_map, CAMERA_NOT_SUPPORTED_IMG_WIDTH, CAMERA_NOT_SUPPORTED_IMG_HEIGHT);

                    Cy_GFXSS_Set_FrameBuffer(base, (uint32_t *)render_target->address, &gfx_context);
                    __DMB();
                }
                while (_device_connected);
            }
        }
#endif
        result = cy_rtos_semaphore_get(&model_semaphore, 0xFFFFFFFF);
        if (CY_RSLT_SUCCESS == result)
        {
#ifdef USE_USB_CAM
            if (_device_connected)
#endif
            {
                /* Update bounding box data and inference time */
                update_box_data(render_target, &prediction);
                update_box_data1(render_target, inference_time);

                VG_switch_frame();

                time_end = ifx_time_get_ms_f();
                time_prev = time_start;
            }
        }
    }
}

